---
kind: property
id: P:Autodesk.Revit.DB.DefinitionBindingMap.Size
source: html/b6f6b525-0a7c-9303-9c5e-15210eacd33a.htm
---
# Autodesk.Revit.DB.DefinitionBindingMap.Size Property

Returns the number of bindings that are in the map.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```